balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ32GP302.PIC
        <edc:SFRDef edc:access="----------------" edc:cname="DCICON2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------" edc:name="DCICON2" edc:nzwidth="16" edc:por="----------------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WS" edc:desc="" edc:mask="0xf" edc:name="WS" edc:nzwidth="0x4"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="COFSG" edc:desc="" edc:mask="0xf" edc:name="COFSG" edc:nzwidth="0x4"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="BLEN" edc:desc="" edc:mask="0x3" edc:name="BLEN" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="WS0" edc:desc="" edc:mask="0x1" edc:name="WS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WS1" edc:desc="" edc:mask="0x1" edc:name="WS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WS2" edc:desc="" edc:mask="0x1" edc:name="WS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WS3" edc:desc="" edc:mask="0x1" edc:name="WS3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="COFSG0" edc:desc="" edc:mask="0x1" edc:name="COFSG0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COFSG1" edc:desc="" edc:mask="0x1" edc:name="COFSG1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COFSG2" edc:desc="" edc:mask="0x1" edc:name="COFSG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COFSG3" edc:desc="" edc:mask="0x1" edc:name="COFSG3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="BLEN0" edc:desc="" edc:mask="0x1" edc:name="BLEN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BLEN1" edc:desc="" edc:mask="0x1" edc:name="BLEN1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----------------" edc:cname="DCICON3" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------" edc:name="DCICON3" edc:nzwidth="16" edc:por="----------------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BCG" edc:desc="" edc:mask="0xfff" edc:name="BCG" edc:nzwidth="0xc"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----------------" edc:cname="DCISTAT" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------" edc:name="DCISTAT" edc:nzwidth="16" edc:por="----------------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMPTY" edc:desc="" edc:mask="0x1" edc:name="TMPTY" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUNF" edc:desc="" edc:mask="0x1" edc:name="TUNF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RFUL" edc:desc="" edc:mask="0x1" edc:name="RFUL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ROV" edc:desc="" edc:mask="0x1" edc:name="ROV" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SLOT" edc:desc="" edc:mask="0xf" edc:name="SLOT" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="SLOT0" edc:desc="" edc:mask="0x1" edc:name="SLOT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLOT1" edc:desc="" edc:mask="0x1" edc:name="SLOT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLOT2" edc:desc="" edc:mask="0x1" edc:name="SLOT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLOT3" edc:desc="" edc:mask="0x1" edc:name="SLOT3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----------------" edc:cname="TSCON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------" edc:name="TSCON" edc:nzwidth="16" edc:por="----------------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSE0" edc:desc="" edc:mask="0x1" edc:name="TSE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSE1" edc:desc="" edc:mask="0x1" edc:name="TSE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSE2" edc:desc="" edc:mask="0x1" edc:name="TSE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSE3" edc:desc="" edc:mask="0x1" edc:name="TSE3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSE4" edc:desc="" edc:mask="0x1" edc:name="TSE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSE5" edc:desc="" edc:mask="0x1" edc:name="TSE5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSE6" edc:desc="" edc:mask="0x1" edc:name="TSE6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSE7" edc:desc="" edc:mask="0x1" edc:name="TSE7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSE8" edc:desc="" edc:mask="0x1" edc:name="TSE8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSE9" edc:desc="" edc:mask="0x1" edc:name="TSE9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSE10" edc:desc="" edc:mask="0x1" edc:name="TSE10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSE11" edc:desc="" edc:mask="0x1" edc:name="TSE11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSE12" edc:desc="" edc:mask="0x1" edc:name="TSE12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSE13" edc:desc="" edc:mask="0x1" edc:name="TSE13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSE14" edc:desc="" edc:mask="0x1" edc:name="TSE14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSE15" edc:desc="" edc:mask="0x1" edc:name="TSE15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="----------------" edc:cname="RSCON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------" edc:name="RSCON" edc:nzwidth="16" edc:por="----------------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSE0" edc:desc="" edc:mask="0x1" edc:name="RSE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSE1" edc:desc="" edc:mask="0x1" edc:name="RSE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSE2" edc:desc="" edc:mask="0x1" edc:name="RSE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSE3" edc:desc="" edc:mask="0x1" edc:name="RSE3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSE4" edc:desc="" edc:mask="0x1" edc:name="RSE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSE5" edc:desc="" edc:mask="0x1" edc:name="RSE5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSE6" edc:desc="" edc:mask="0x1" edc:name="RSE6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSE7" edc:desc="" edc:mask="0x1" edc:name="RSE7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSE8" edc:desc="" edc:mask="0x1" edc:name="RSE8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSE9" edc:desc="" edc:mask="0x1" edc:name="RSE9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSE10" edc:desc="" edc:mask="0x1" edc:name="RSE10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSE11" edc:desc="" edc:mask="0x1" edc:name="RSE11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSE12" edc:desc="" edc:mask="0x1" edc:name="RSE12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSE13" edc:desc="" edc:mask="0x1" edc:name="RSE13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSE14" edc:desc="" edc:mask="0x1" edc:name="RSE14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSE15" edc:desc="" edc:mask="0x1" edc:name="RSE15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="RXBUF0" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="RXBUF0" edc:nzwidth="16" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXBUF0" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="RXBUF0" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
